ads/bucketsort.html
---
layout: page
title: Bucketsort
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Bucketsort</h2>
<div class="outline-text-2" id="text-1">
<p>
Verfahren zum sortieren von natürlichen Zahlen, die nach oben begrenzt
sind.
</p>

<p>
<b>Gegeben:</b> \(n\) Zahlen \(x_{0},..., x_{n-1} \in \{0,..., m-1\}\), die
zunächst in einem Feld \(A[0], ... A[n-1]\) gespeichert sind.
</p>

<p>
<b>Idee:</b> (Bucketsort nutzt aus , dass alle Zahlen \(\leq m-1\)) Verwende
ein Feld von <i>Buckets</i> (Eimern) \(B[0],..., B[m-1]\). Jedes Bucket enhält
eine Liste von Elementen, die zunächste leer ist. Zusätzlich enthält
jedes Bucket einen Verweis auf das erste und letzte Element dieser
Liste.
</p>

<p>
<b>Bemerkung:</b> Enthält jede Liste einen Zeiger auf ihr letztes Element, so
können wir in \(\mathcal{O}(1)\) Zeit Elemente einfügen und
aneinanderhängen. Also ist LZ O(n+m)
</p>

<pre class="example">
BUCKETSORT(A, m) {
  integer n = length(A);
  erzeuge Feld B mit m leeren Buckets;

  for i = 0 to n-1 do
    füge A[i] am Ende der Liste B[A[i]] ein;
  od

  for j = 1 to m-1 do
    hänge Liste in B[j] am Ende der Liste in B[0] ein;
  od
</pre>
</div>
</div>
